In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.3'

In [3]:
raw_data1 = {
    'id': [1,2,3,4,5],
    'city': ['Tripoli', 'London', 'Rome', 'Cairo', 'Sydney'], 
    'rank': ['1st', '2nd', '3rd', '4th', '5th'], 
    'population': ['2M', '10M', '1M', '20M', '3M']
}
df1 = pd.DataFrame(raw_data1, columns = ['id', 'city', 'rank', 'population'])
df1

   id     city rank population
0   1  Tripoli  1st         2M
1   2   London  2nd        10M
2   3     Rome  3rd         1M
3   4    Cairo  4th        20M
4   5   Sydney  5th         3M

In [4]:
raw_data1 = {
    'id': [11,22],
    'city': ['Leeds', 'Bath'], 
    'rank': ['1st', '2nd'], 
    'population': ['2M', '1M']
}
df2 = pd.DataFrame(raw_data1, columns = ['id', 'city', 'rank', 'population'])
df2

   id   city rank population
0  11  Leeds  1st         2M
1  22   Bath  2nd         1M

In [6]:
## to add new rows at a specific location .. slice your DF at that location
## and merge

slice1 = df1.iloc[0:2,:]
slice2 = df1.iloc[2:,:]

   id    city rank population
2   3    Rome  3rd         1M
3   4   Cairo  4th        20M
4   5  Sydney  5th         3M

In [8]:
## you have two slices and the data you want to insert between them
## use pandas' concat for that
pd.concat([slice1, df2, slice2], ignore_index=True, axis=1)

   id     city rank population
0   1  Tripoli  1st         2M
1   2   London  2nd        10M
2  11    Leeds  1st         2M
3  22     Bath  2nd         1M
4   3     Rome  3rd         1M
5   4    Cairo  4th        20M
6   5   Sydney  5th         3M

In [13]:
# Insert column into DataFrame at specified location.
df1.insert(2,'New_colns', col)

In [10]:
col = df1['population']

In [11]:
col

0     2M
1    10M
2     1M
3    20M
4     3M
Name: population, dtype: object

In [14]:
df1

   id     city New_colns rank population
0   1  Tripoli        2M  1st         2M
1   2   London       10M  2nd        10M
2   3     Rome        1M  3rd         1M
3   4    Cairo       20M  4th        20M
4   5   Sydney        3M  5th         3M